---
kind: type
id: T:Autodesk.Revit.DB.Architecture.HandRailPosition
source: html/e148ecf7-7d63-4209-24f4-1add948318f9.htm
---
# Autodesk.Revit.DB.Architecture.HandRailPosition

The position of the hand rail.

## Syntax (C#)
```csharp
public enum HandRailPosition
```